<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and imports Komodo Edit into Munki.

Note: This recipe currently generates a pkginfo that uses
KomodoEdit's CFBundleShortVersion for comparison, but this
version misses the third version component. CFBundleVersion
should instead be used, but we currently don't have a way
to tell MunkiImporter (or makepkginfo more specifically)
use a different version_comparison_string when building
installs items. It's therefore recommended to manually
update the pkginfo version to that of the installs item's
CFBundleVersion, and use CFBundleVersion for the
version_comparison_string.
</string>
    <key>Identifier</key>
    <string>com.github.timsutton.munki.KomodoEdit</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KomodoEdit</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Komodo Edit is a lean editor with a sleek interface. You'll enjoy excellent coding in many web languages, including Python, PHP, Ruby, Perl, HTML, CSS and JavaScript</string>
            <key>display_name</key>
            <string>Komodo Edit</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.timsutton.download.KomodoEdit</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
