<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Amadeus Pro 2.
    </string>
    <key>Identifier</key>
    <string>com.github.timsutton.download.AmadeusPro2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AmadeusPro2</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
<dict>
    <key>Processor</key>
    <string>HairerSoftUpdateInfoProvider</string>
    <key>Arguments</key>
    <dict>
        <key>product_name</key>
        <string>AmadeusPro2</string>
    </dict>
</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
