<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of REDCINE-X PRO from the in-app Sparkle feed.

The application also contains references to a Sparkle URL for beta updates:
http://red.cachefly.net/redcinex/appcast/mac_pkg_beta.xml

SPARKLE_FEED_URL could be overridden to the above if you wish to fetch beta versions.</string>
    <key>Identifier</key>
    <string>com.github.timsutton.download.redcine-xpro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>REDCINE-XPRO</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>data-name="REDCINE-X PRO \(MAC\)" data-versioninternalid="(\d+)" download=</string>
                <key>result_output_var_name</key>
                <string>versionid</string>
                <key>url</key>
                <string>https://www.red.com/download/redcine-x-pro-mac</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>versionUrl":"(https://downloads\.red\.com/software/rcx/mac/release/[\d\.]+/REDCINE-X_PRO_Build_[\d\.]+\.pkg)"}</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>url</key>
                <string>https://www.red.com/RedSuiteCentric/SCA-Kilimanjaro/services/DownloadUrl.Service.ss?internalid=%versionid%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
