CTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the current release version of Audacity via the project
      website. The downloads redirect to a fosshub.com download page, which
      is also searched for a download link.
      Note: the Audacity.app code object is not signed at all.</string>
      <key>Identifier</key>
      <string>com.github.timsutton.download.audacity</string>
      <key>Input</key>
      <dict>
        <key>NAME</key>
        <string>Audacity</string>
      </dict>
      <key>MinimumVersion</key>
      <string>0.2.9</string>
      <key>Process</key>
      <array>
        <dict>
          <key>Processor</key>
          <string>URLTextSearcher</string>
          <key>Arguments</key>
          <dict>
            <key>url</key>
            <string>https://www.fosshub.com/Audacity.html</string>
            <!-- More specific than http://audacityteam.org, which shows Windows links by default -->
            <key>re_pattern</key>
            <string>(?P&lt;first_url&gt;/.*?dmg)</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>URLTextSearcher</string>
          <key>Arguments</key>
          <dict>
            <key>url</key>
            <string>https://www.fosshub.com%first_url%</string>
            <key>re_pattern</key>
            <string>(?P&lt;file&gt;https.*?dmg)</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>URLTextSearcher</string>
          <key>Arguments</key>
          <dict>
            <key>url</key>
            <string>%file%</string>
            <key>re_pattern</key>
            <string></string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>URLDownloader</string>
        </dict>
        <dict>
          <key>Processor</key>
          <string>EndOfCheckPhase</string>
        </dict>
      </array>
    </dict>
</plist>

