<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of iStopMotion 3.

We have to send a fair amount of information to the server that
returns a Sparkle feed.</string>
    <key>Identifier</key>
    <string>com.github.timsutton.download.iStopMotion</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>iStopMotion</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_query_pairs</key>
                <dict>
                    <key>appName</key>
                    <string>iStopMotion</string>
<!-- appVersion is the CFBundleVersion of the app - we don't seem to need it,
     or it could be just '0'
                    <key>appVersion</key>
                    <string>15980</string>
 -->                    <key>lang</key>
                    <string>en</string>
                    <key>appID</key>
                    <string>ISTO</string>
<!-- We need versionString to be something, picking the first 3.x version seems to work -->
                    <key>versionString</key>
                    <string>3.0</string>
                    <key>locale</key>
                    <string>en_US</string>
                    <key>feedtype</key>
                    <string>1</string>
                </dict>
                <key>appcast_url</key>
                <string>https://sparkle.boinx.com/appcast.lasso</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
