<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the most recent version of DaVinci Fusion 8 and imports it into Munki.

Please see directions in the download recipe about additional Input variables required for this
recipe.
</string>
    <key>Identifier</key>
    <string>com.github.timsutton.munki.fusion8</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Fusion8</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Fusion 8.app</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Fusion is the world’s most advanced compositing software for visual effects artists, broadcast and motion graphic designers and 3D animators.</string>
            <key>display_name</key>
            <string>Fusion 8</string>
            <key>minimum_os_version</key>
            <string>10.10.0</string>
            <key>name</key>
            <string>%NAME%</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.timsutton.download.fusion8</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unzip/*.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%found_filename%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
