<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the most recent version of Ableton Live 9.
Supports two additional variables to get different editions and builds:

ARCH: either '64' or '32'
EDITION: one of 'intro', 'standard', and 'suite'.</string>
    <key>Identifier</key>
    <string>com.github.timsutton.download.AbletonLive9</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AbletonLive9</string>
        <key>ARCH</key>
        <string>64</string>
        <key>EDITION</key>
        <string>standard</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.ableton.com/en/release-notes/live-9/</string>
                <key>re_pattern</key>
                <string>(?P&lt;version&gt;9\.[\d\.]+)\s+Release\sNotes</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cdn2-downloads.ableton.com/channels/%version%/ableton_live_%EDITION%_%version%_%ARCH%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/%app_name%</string>
                <key>requirement</key>
                <string>identifier "com.ableton.live" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = MWR434WD94</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
