<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Consul from http://consul.io</string>
    <key>Identifier</key>
    <string>com.github.timsutton.download.Consul</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Consul</string>
        <key>PRODUCT</key>
        <string>consul</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>HashiCorpCheckpointDataProvider</string>
            <key>Arguments</key>
            <dict>
                <key>product</key>
                <string>%PRODUCT%</string>
            </dict>            
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%hashicorp_product_download_page%</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http.*?darwin_amd64.zip)</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
