<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Packer from http://packer.io</string>
    <key>Identifier</key>
    <string>com.github.timsutton.download.Packer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Packer</string>
        <key>PRODUCT</key>
        <string>packer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>io.github.hjuutilainen.download.Vault/HashiCorpURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>arch</key>
                <string>amd64</string>
                <key>project_name</key>
                <string>%PRODUCT%</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
