<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Packer from http://packer.io</string>
    <key>Identifier</key>
    <string>com.github.timsutton.download.Packer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Packer</string>
        <key>PRODUCT</key>
        <string>packer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>Process</key>
    <array>
        <!-- Not using HashiCorpCheckpointDataProvider to get the Packer
        URL because the packer.io HTTPS URL currently has issues with SSL
        on Python 2.7 on OS X
        Instead grab 'url' and 'version' vars from a URL like:
        https://dl.bintray.com/mitchellh/packer/packer_0.8.0_darwin_amd64.zip -->
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://packer.io/downloads.html</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http.*?packer_(?P&lt;version&gt;.*?)_darwin_amd64.zip)</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
